package com.daengdaeng_eodiga.project.region.enums;

import java.util.Arrays;
import java.util.Collections;
import java.util.List;

import lombok.Getter;

@Getter
public enum Regions {
	서울(Arrays.asList(
		"강남구", "강동구", "강북구", "강서구", "관악구",
		"광진구", "구로구", "금천구", "노원구", "도봉구",
		"동대문구", "동작구", "마포구", "서대문구", "서초구",
		"성동구", "성북구", "송파구", "양천구", "영등포구",
		"용산구", "은평구", "종로구", "중구", "중랑구"
	)),
	경기(Arrays.asList(
		"성남시", "수원시", "용인시", "화성시", "안양시", "과천시",
		"군포시", "의왕시", "부천시", "안산시", "시흥시",
		"광명시", "평택시", "오산시", "안성시", "고양시",
		"파주시", "김포시", "가평군", "양평군", "광주시",
		"이천시", "여주시", "남양주시", "의정부시",
		"하남시", "구리시", "포천시", "양주시",
		"동두천시", "연천군"
	)),
	인천(Arrays.asList(
		"연수구", "남동구", "부평구", "계양구", "중구",
		"서구", "미추홀구", "동구", "강화군", "옹진군"
	)),
	부산(Arrays.asList(
		"해운대구", "기장군", "수영구", "남구", "부산진구",
		"동구", "중구", "서구", "영도구", "연제구",
		"동래구", "금정구", "북구", "사상구", "강서구", "사하구"
	)),
	제주(Arrays.asList("제주시", "서귀포시")),
	울산(Arrays.asList("남구", "중구", "동구", "북구", "울주군")),
	경남(Arrays.asList(
		"창원시", "김해시", "양산시", "밀양시", "거제시",
		"통영시", "고성군", "진주시", "사천시",
		"남해군", "하동군", "거창군", "함안군",
		"창녕군", "합천군", "의령군", "산청군", "함양군"
	)),
	대구(Arrays.asList(
		"중구", "동구", "수성구", "남구", "북구",
		"서구", "달서구", "달성군", "군위군"
	)),
	경북(Arrays.asList(
		"포항시", "경주시", "김천시", "구미시", "성주군",
		"칠곡군", "고령군", "안동시", "문경시",
		"상주시", "영주시", "예천군", "의성군",
		"봉화군", "경산시", "영천시", "청도군",
		"울진군", "영양군", "영덕군", "청송군", "울릉군"
	)),
	강원(Arrays.asList(
		"강릉시", "동해시", "삼척시", "속초시", "양양군",
		"고성군", "인제군", "원주시", "횡성군",
		"춘천시", "철원군", "화천군", "양구군",
		"홍천군", "태백시", "영월군", "평창군", "정선군"
	)),
	대전(Arrays.asList("유성구", "대덕구", "서구", "중구", "동구")),
	충남(Arrays.asList(
		"천안시", "아산시", "보령시", "부여군", "서천군",
		"공주시", "계룡시", "금산군", "논산시",
		"청양군", "당진시", "태안군", "안면도",
		"서산시", "예산군", "홍성군"
	)),
	충북(Arrays.asList(
		"청주시", "충주시", "제천시", "진천군", "음성군",
		"단양군", "보은군", "옥천군", "괴산군",
		"증평군", "영동군"
	)),
	세종(Collections.singletonList("세종")),
	전남(Arrays.asList(
		"여수시", "순천시", "광양시", "목포시",
		"영암군", "무안군", "신안군", "담양군",
		"곡성군", "구례군", "화순군", "해남군",
		"완도군", "진도군", "강진군", "장흥군",
		"보성군", "고흥군", "나주시", "함평군",
		"영광군", "장성군"
	)),
	광주(Arrays.asList("서구", "광산구", "동구", "남구", "북구")),
	전북(Arrays.asList(
		"전주시", "완주군", "군산시", "익산시",
		"정읍시", "부안군", "김제시", "고창군",
		"남원시", "임실군", "순창군", "무주군",
		"진안군", "장수군"
	));

	private final List<String> cityDetails;

	Regions(List<String> cityDetails) {
		this.cityDetails = cityDetails;
	}

}
